[
    {
        "title": "Sky's blue",
        "date": "10/4/23",
        "content": "Got an invite from a friend and made a bluesky page, my handle there is just my website if you wanna find me"
    },
    {
        "title": "Twitter",
        "date": "11/26/22 (edited 10/4/23)",
        "content": "I've decided to stop posting to my main Twitter account, in favor of posting to Tumblr from now on. The platform in it's current state has been a detriment to my mental health and I don't think it's a good idea to hang out there anymore. All my art will either be at eggnogo.tumblr.com or at you-know-where"
    },
    {
        "title": "Redesign",
        "date": "9/5/22",
        "content": "The old site design was kinda hard to read and didn't really fit the style I wanted, so I spent some time on it this week and made it look more how I wanted it to. Gonna upload more recent art to the art page soon"
    },
    {
        "title": "Javascript!",
        "date": "5/16/22",
        "content": "Instead of being weird static code, this page is all automatically generated by a couple lines of javascript I tossed together as practice. Less strenuous on the backend than having php load something that simple, and I got to try some stuff - Also there's an art page now"
    },
    {
        "title": "What now?",
        "date": "1/21/22",
        "content": "I dunno, don't really know what I wanna do with these couple of pages now - I'll think of something later"
    },
    {
        "title": "Art",
        "date": "1/20/22",
        "content": "I think I've been drawing for about 7 years now, doesn't feel like I've gotten very far but my friends tell me otherwise so maybe I'm wrong - Still got a long way to go until my art skills are where I want them to be - My twitter page (the one I post in the most often), my deviantart page, and my github page (for my programming projects and also this website), are all stored in the \"Link Zone\" page at the top of this one"
    },
    {
        "title": "Programming",
        "date": "1/20/22",
        "content": "Programming is another one of those things that I only like doing for fun, although I still do it at work a lot - My biggest project so far is Kit (name change pending), a discord bot that's been my outlet for the past 5 years or so while I learned how to use Javascript - Her and all her ugly code is available on my github page"
    }
]